class Пользователь:
    def __init__(self, имя, фамилия, почтовый_код):
        self.имя = имя
        self.фамилия = фамилия
        self.почтовый_код = почтовый_код
        self.счета = []

    def добавить_счет(self, валюта):
        новый_счет = Счет(валюта)
        self.счета.append(новый_счет)
        return новый_счет
    class Счет:
        def __init__(self, валюта):
            self.валюта = валюта
            self.баланс = 0
if __name__ == "__main__":
    пользователь = Пользователь("Иван", "Иванов", "12345")
    счет_доллар = пользователь.добавить_счет("Dollar")
    счет_фунт = пользователь.добавить_счет("Pound")
    счет_рупия = пользователь.добавить_счет("Rupee")

    счет_доллар.баланс = 1000
    счет_фунт.баланс = 500
    счет_рупия.баланс = 2000

    print(f"Пользователь: {пользователь.имя} {пользователь.фамилия}")
    for счет in пользователь.счета:
        print(f"Счет в {счет.валюта}: {счет.баланс}")